def convert_to_base(n, base):  # рекурсивная функция перевода числа в заданную систему
    if n == 0:  # если число 0, то возвращаем пустую строку
        return "" 
    chars = "0123456789ABCDEF"  # алфавит для систем счисления до 16ричной
    return convert_to_base(n // base, base) + chars[n % base]  # рекурсивный вызов + текущий остаток

num = int(input("введите целое число: "))  # просим ввести число
base = int(input("введите основание системы: "))  # просим ввести основание

if num == 0:  # проверка, если ввели 0
    print("Результат: 0")  # выводим 0
else:
    print(f"Результат: {convert_to_base(num, base)}")  # выводим результат работы функции